Revit 2027 API
Transaction Methods
The Transaction type exposes the following members.
Methods
Name | Description
Commit() |  Commits all changes made to the model during the transaction.
Commit(FailureHandlingOptions) |  Commits all changes made to the model during the transaction.
Dispose
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetFailureHandlingOptions |  Returns the current failure handling options.
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetName |  Returns the transaction's name.
GetStatus |  Returns the current status of the transaction.
GetType | Gets the Type of the current instance.
(Inherited from Object)
HasEnded |  Determines whether the transaction has ended already.
HasStarted |  Determines whether the transaction has been started yet.
RollBack() |  Rolls back all changes made to the model during the transaction.
RollBack(FailureHandlingOptions) |  Rolls back all changes made to the model during the transaction.
SetFailureHandlingOptions |  Sets options for handling failures to be used when the transaction is being committed or rolled back.
SetName |  Sets the transaction's name.
Start() |  Starts the transaction.
Start(String) |  Starts the transaction with an assigned name.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
Transaction Class
Autodesk.Revit.DB Namespace